* tasks
** bugs
*** TODO fix helpers macro 'dolist-li-a'
*** DONE db
    CLOSED: [2012-06-29 Fri 17:48]
    :CLOCK:
    CLOCK: [2012-06-27 Wed 11:49]--[2012-06-27 Wed 11:50] =>  0:01
    :END:
    - [X] id != title when add-articles
    - [X] last-id of article not incrementing when add-articles
*** DONE pagination (http://localhost:8000/t/scrambled/3/ should not show page#s > 3)
    CLOSED: [2012-06-21 Thu 11:52]
    :CLOCK:
    CLOCK: [2012-06-21 Thu 11:47]--[2012-06-21 Thu 11:52] =>  0:05
    :END:
*** DONE cat/subcat pages (some fn not found)
    CLOSED: [2012-06-21 Thu 11:15]
    :CLOCK:
    CLOCK: [2012-06-21 Thu 11:12]--[2012-06-21 Thu 11:15] =>  0:03
    :END:
** next
   - [ ] show only active (ones that have some articles in them) authors, categories and tags in navigation
   - [ ] article, navigation look-n-feel
   - [ ] parenscript for categories/tags/authors in navigation
   - [ ] photos
   - [ ] populate *current-dimensions-string* for every request and make it thread-safe
   - [ ] cache
   - [ ] tests
   - [ ] header, footer look-n-feel
   - [ ] logo, favicon
   - [ ] seo
     - [ ] meta-keywords (tags + cat/subcat)
   - [ ] performance
     - [ ] http caching headers
   - [ ] security
     - [ ] escape input/editorial data
     - [ ] escape printing user-inputted data
       - search for 'alert ("hi");' should not show alert
   - [X] config
   - [X] 'master' in config
   - [X] populate/tmp-init of categories/tags
   - [X] add authors
   - [X] author/category/tag pages
   - [X] layout
   - [X] static files
   - [X] db
     - [X] active articles and authors
     - [X] edit articles (to activate/approve them)
** TODO frontend
*** misc
**** TODO show only active (ones that have some articles in them) authors, categories and tags in navigation
     :CLOCK:
     CLOCK: [2012-07-03 Tue 17:40]--[2012-07-03 Tue 18:14] =>  0:34
     :END:
**** DONE static files
     CLOSED: [2012-06-21 Thu 15:13]
     :CLOCK:
     CLOCK: [2012-06-21 Thu 14:27]--[2012-06-21 Thu 15:00] =>  0:33
     CLOCK: [2012-06-21 Thu 13:50]--[2012-06-21 Thu 14:10] =>  0:20
     :END:
**** DONE db
     CLOSED: [2012-07-03 Tue 16:17]
     :CLOCK:
     CLOCK: [2012-07-03 Tue 15:21]--[2012-07-03 Tue 16:17] =>  0:56
     CLOCK: [2012-07-03 Tue 14:49]--[2012-07-03 Tue 15:10] =>  0:21
     CLOCK: [2012-06-26 Tue 19:30]--[2012-06-26 Tue 20:00] =>  0:30
     CLOCK: [2012-06-26 Tue 17:30]--[2012-06-26 Tue 19:02] =>  1:32
     CLOCK: [2012-06-26 Tue 12:19]--[2012-06-26 Tue 12:35] =>  0:16
     CLOCK: [2012-06-21 Thu 19:00]--[2012-06-21 Thu 19:51] =>  0:51
     CLOCK: [2012-06-21 Thu 15:00]--[2012-06-21 Thu 17:40] =>  2:40
     :END:
     - this completes the CRU (D isn't needed) of DB using cl-prevalence
**** TODO navigation
*** TODO views
    :CLOCK:
    CLOCK: [2012-06-20 Wed 18:50]--[2012-06-20 Wed 20:11] =>  1:21
    :END:
**** common
***** TODO layout
      :CLOCK:
      CLOCK: [2012-06-29 Fri 17:52]--[2012-06-29 Fri 18:01] =>  0:09
      CLOCK: [2012-06-20 Wed 17:55]--[2012-06-20 Wed 18:48] =>  0:53
      CLOCK: [2012-06-20 Wed 14:12]--[2012-06-20 Wed 17:15] =>  3:03
      :END:
      - http://travel.yahoo.com/ideas/
      - http://travel.yahoo.com/ideas/five-miles-up-with-----christopher-gorham.html
***** TODO navigation
      :CLOCK:
      CLOCK: [2012-06-20 Wed 13:19]--[2012-06-20 Wed 14:12] =>  0:53
      CLOCK: [2012-06-19 Tue 19:00]--[2012-06-19 Tue 19:26] =>  0:26
      CLOCK: [2012-06-19 Tue 17:36]--[2012-06-19 Tue 18:11] =>  0:35
      CLOCK: [2012-06-19 Tue 16:35]--[2012-06-19 Tue 17:35] =>  1:00
      CLOCK: [2012-06-14 Thu 13:46]--[2012-06-14 Thu 15:15] =>  1:29
      CLOCK: [2012-06-13 Wed 11:41]--[2012-06-13 Wed 12:02] =>  0:21
      CLOCK: [2012-06-13 Wed 08:40]--[2012-06-13 Wed 10:40] =>  2:00
      CLOCK: [2012-06-12 Tue 19:26]--[2012-06-12 Tue 20:26] =>  1:00
      :END:
***** header
****** logo
****** trending
****** TODO navigation
	   :CLOCK:
	   CLOCK: [2012-06-08 Fri 16:44]--[2012-06-08 Fri 16:45] =>  0:01
	   :END:
***** footer
***** ads
***** TODO #views
      :CLOCK:
      CLOCK: [2012-06-13 Wed 11:14]--[2012-06-13 Wed 11:35] =>  0:21
      CLOCK: [2012-06-13 Wed 10:55]--[2012-06-13 Wed 11:14] =>  0:19
      :END:
***** TODO pagination
**** DONE home
     CLOSED: [2012-06-20 Wed 20:12]
***** latest
***** most-popular
**** DONE article
     CLOSED: [2012-06-20 Wed 20:12]
     :CLOCK:
     CLOCK: [2012-06-19 Tue 14:48]--[2012-06-19 Tue 15:40] =>  0:52
     :END:
***** related-carousel
**** DONE cat/subcat
     CLOSED: [2012-06-20 Wed 20:12]
***** list of other cat/subcat
**** DONE author
     CLOSED: [2012-06-20 Wed 20:12]
     :CLOCK:
     CLOCK: [2012-06-20 Wed 17:34]--[2012-06-20 Wed 17:54] =>  0:20
     :END:
***** list of other authors
**** DONE tags
     CLOSED: [2012-06-20 Wed 20:12]
***** list of other tags
*** TODO wireframes
    :CLOCK:
    CLOCK: [2012-06-13 Wed 10:40]--[2012-06-13 Wed 10:54] =>  0:14
    :END:
*** TODO routes
    :CLOCK:
	CLOCK: [2012-06-08 Fri 15:11]--[2012-06-08 Fri 16:00] =>  0:49
    CLOCK: [2012-06-08 Fri 13:02]--[2012-06-08 Fri 13:06] =>  0:04
    :END:
    - [X] home
    - [X] home-page
    - [X] cat
    - [X] cat-subcat
    - [X] tag
    - [X] author
    - [X] article
    - [ ] static-files
    - [X] search
*** [[*models][models]]
*** DONE template@pencil
     CLOSED: [2012-06-08 Fri 14:35]
    :CLOCK:
    CLOCK: [2012-06-08 Fri 13:59]--[2012-06-08 Fri 14:35] =>  0:36
    :END:
    - [X] template
    - [X] navigation
*** nginx
	- [ ] proxy
	- [ ] static files
	- [ ] caching
*** future requirements/improvements
    - extra (empty), user-settable, primary-navigation fields
      - html5
      - html4 + cookie
    - related articles
      - users who viewed this also viewed
        - http://coding.smashingmagazine.com/2011/03/23/speeding-up-your-websites-database/
          - How Can A Database Slow Down A Website?
          - …Or Just Cheat
** TODO refactor
   :CLOCK:
   CLOCK: [2012-06-21 Thu 13:19]--[2012-06-21 Thu 13:47] =>  0:28
   CLOCK: [2012-06-21 Thu 11:59]--[2012-06-21 Thu 12:06] =>  0:07
   CLOCK: [2012-06-21 Thu 11:15]--[2012-06-21 Thu 11:46] =>  0:31
   :END:
** utils
*** DONE config
    CLOSED: [2012-06-30 Sat 00:32]
    :CLOCK:
    CLOCK: [2012-06-29 Fri 23:32]--[2012-06-30 Sat 00:32] =>  1:00
    CLOCK: [2012-06-29 Fri 18:52]--[2012-06-29 Fri 20:16] =>  1:24
    CLOCK: [2012-06-19 Tue 16:22]--[2012-06-19 Tue 16:35] =>  0:13
    CLOCK: [2012-06-19 Tue 15:42]--[2012-06-19 Tue 16:10] =>  0:28
    CLOCK: [2012-06-19 Tue 14:27]--[2012-06-19 Tue 14:47] =>  0:20
    CLOCK: [2012-06-18 Mon 15:48]--[2012-06-18 Mon 17:42] =>  1:54
    CLOCK: [2012-06-18 Mon 13:33]--[2012-06-18 Mon 15:06] =>  1:33
    CLOCK: [2012-06-18 Mon 13:07]--[2012-06-18 Mon 13:21] =>  0:14
    CLOCK: [2012-06-18 Mon 11:07]--[2012-06-18 Mon 12:07] =>  1:00
    CLOCK: [2012-06-15 Fri 16:32]--[2012-06-15 Fri 20:04] =>  3:32
    :END:
*** cache
    - w/ time for each with-cache call
    - cache BE calls (especially DB reads)
    - http://static.springsource.org/spring/docs/3.1.0.M1/spring-framework-reference/html/cache.html (Look for @Cacheable, key generation and @CacheEvict)
** editorial
*** TODO models
	:CLOCK:
    CLOCK: [2012-06-08 Fri 19:07]--[2012-06-08 Fri 20:15] =>  1:08
	CLOCK: [2012-06-08 Fri 17:20]--[2012-06-08 Fri 18:20] =>  1:00
	CLOCK: [2012-06-08 Fri 16:45]--[2012-06-08 Fri 17:11] =>  0:26
	:END:
    - [ ] user
    - [ ] author(user)
    - [ ] category
    - [ ] tag
    - [ ] view
    - [ ] article
*** TODO initial content
    :CLOCK:
    CLOCK: [2012-06-08 Fri 14:43]--[2012-06-08 Fri 14:50] =>  0:07
    :END:
**** categories [fn:1] [fn:2]
     - Sports
       - American Football
       - Badminton
       - Baseball
       - Basketball
       - Boxing
       - Cricket
       - Cycling
       - Hockey
       - Golf
       - Handball
       - Olympics
       - Racing
       - Rugby
       - Table Tennis
       - Tennis
     - Entenrtainment
       - Arts
       - Books
       - Celebrities
       - Movies
       - Music
       - TV
       - Humor
     - Lifestyle
       - Automotive
       - Culture
       - Food and Beverage
       - Home and Garden
       - Theatre
       - Travel
       - Health
     - Technology
       - Computing
       - Internet
       - Personal Technology
       - Video Games
     - Business
       - Companies
       - Economy
       - Industry
       - Markets
     - Education
     - Science
       - Environmenent
       - Geography
       - Space
     - Headlines
     - Politics
     - Religion
** utils
*** html
*** caching
*** db
*** init
*** config
*** l10n
** queue
*** producer (boomerang)
*** consumer (cron)
** reports
** horizontal
*** tests
**** TODO fiveam
     :CLOCK:
     :END:
     - http://msnyder.info/posts/2011/07/lisp-for-the-web-part-ii/#sec-7
     - http://aperiodic.net/phil/archives/Geekery/notes-on-lisp-testing-frameworks.html
     - http://www.cliki.net/test%20framework
**** coverage (sb-cover)
* notes
** restas
   - routes:
	 - trailing 'slash' should be put explicitly, to avoid matching to no/multiple rules
	 - *submodule* and *route* special variables are populated during request, and aren't available from slime
* Footnotes
[fn:1] http://en.wikipedia.org/wiki/Wikipedia:Category
[fn:2] http://support.google.com/webmasters/bin/answer.py?hl=en&answer=42993
